blog/2020/hugo-problems-with-no-extended.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 13:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Hugo 没有安装扩展版产生的问题</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Hugo 没有安装扩展版产生的问题</h1>
</header><p>
如果没有安装 Hugo 扩展版，在执行 <code>hugo server</code> 命令时，会报如下错误：
</p>

<pre class="example" id="orgfbec206">
Building sites … Total in 303 ms
Error: Error building site: TOCSS: failed to transform "zh/styles/ma
in-rendered.scss" (text/x-scss): resource "scss/scss/main.scss_a059ebc49e8302e6cfbf0e02020b9d85" not found in file cache
</pre>

<p>
解决办法：
</p>

<p>
下载 <a href="https://github.com/gohugoio/hugo/releases">Hugo 扩展版</a>。在 releases 中，有形如 <code>hugo_extended_0.70.0_Windows-64bit.zip</code> 的，即为扩展版本</p>
</div>
</body>
</html>